GopalSaraf/Practicals/PSDL/include/proc/pic18lf46j53.inc
#define CSRC2                            BANKMASK(TXSTA2), 7, a
#define CTED1                            BANKMASK(PORTB), 2, a
#define CTED2                            BANKMASK(PORTB), 3, a
#define CTMUEN                           BANKMASK(CTMUCONH), 7, a
#define CTMUIE                           BANKMASK(PIE3), 2, a
#define CTMUIF                           BANKMASK(PIR3), 2, a
#define CTMUIP                           BANKMASK(IPR3), 2, a
#define CTMUMD                           BANKMASK(PMDIS1), 6, b
#define CTMUSIDL                         BANKMASK(CTMUCONH), 5, a
#define CTPLS                            BANKMASK(PORTC), 2, a
#define CTTRIG                           BANKMASK(CTMUCONH), 0, a
#define CVR0                             BANKMASK(CVRCON), 0, b
#define CVR1                             BANKMASK(CVRCON), 1, b
#define CVR2                             BANKMASK(CVRCON), 2, b
#define CVR3                             BANKMASK(CVRCON), 3, b
#define CVREF                            BANKMASK(PORTA), 2, a
#define CVREN                            BANKMASK(CVRCON), 7, b
#define CVROE                            BANKMASK(CVRCON), 6, b
#define CVROEN                           BANKMASK(CVRCON), 6, b
#define CVRR                             BANKMASK(CVRCON), 5, b
#define CVRSS                            BANKMASK(CVRCON), 4, b
#define DA                               BANKMASK(SSP1STAT), 5, a
#define DA1                              BANKMASK(SSP1STAT), 5, a
#define DA2                              BANKMASK(SSP2STAT), 5, a
#define DATA_ADDRESS                     BANKMASK(SSP1STAT), 5, a
#define DATA_ADDRESS2                    BANKMASK(SSP2STAT), 5, a
#define DC                               BANKMASK(STATUS), 1, a
#define DC10B0                           BANKMASK(CCP10CON), 4, b
#define DC10B1                           BANKMASK(CCP10CON), 5, b
#define DC1B0                            BANKMASK(CCP1CON), 4, a
#define DC1B1                            BANKMASK(CCP1CON), 5, a
#define DC2B0                            BANKMASK(CCP2CON), 4, a
#define DC2B1                            BANKMASK(CCP2CON), 5, a
#define DC3B0                            BANKMASK(CCP3CON), 4, b
#define DC3B1                            BANKMASK(CCP3CON), 5, b
#define DC4B0                            BANKMASK(CCP4CON), 4, b
#define DC4B1                            BANKMASK(CCP4CON), 5, b
#define DC5B0                            BANKMASK(CCP5CON), 4, b
#define DC5B1                            BANKMASK(CCP5CON), 5, b
#define DC6B0                            BANKMASK(CCP6CON), 4, b
#define DC6B1                            BANKMASK(CCP6CON), 5, b
#define DC7B0                            BANKMASK(CCP7CON), 4, b
#define DC7B1                            BANKMASK(CCP7CON), 5, b
#define DC8B0                            BANKMASK(CCP8CON), 4, b
#define DC8B1                            BANKMASK(CCP8CON), 5, b
#define DC9B0                            BANKMASK(CCP9CON), 4, b
#define DC9B1                            BANKMASK(CCP9CON), 5, b
#define DFN8EE                           BANKMASK(UEIE), 3, b
#define DFN8EF                           BANKMASK(UEIR), 3, a
#define DIR                              BANKMASK(USTAT), 2, a
#define DLYCYC0                          BANKMASK(DMACON2), 4, a
#define DLYCYC1                          BANKMASK(DMACON2), 5, a
#define DLYCYC2                          BANKMASK(DMACON2), 6, a
#define DLYCYC3                          BANKMASK(DMACON2), 7, a
#define DLYINTEN                         BANKMASK(DMACON1), 1, a
#define DMAEN                            BANKMASK(DMACON1), 0, a
#define DONE                             BANKMASK(ADCON0), 1, a
#define DSBOR                            BANKMASK(DSCONL), 1, b
#define DSEN                             BANKMASK(DSCONH), 7, b
#define DSFLT                            BANKMASK(DSWAKEL), 7, b
#define DSINT0                           BANKMASK(DSWAKEH), 0, b
#define DSMCLR                           BANKMASK(DSWAKEL), 2, b
#define DSPOR                            BANKMASK(DSWAKEL), 0, b
#define DSRTC                            BANKMASK(DSWAKEL), 3, b
#define DSULP                            BANKMASK(DSWAKEL), 5, b
#define DSULPEN                          BANKMASK(DSCONH), 1, b
#define DSWDT                            BANKMASK(DSWAKEL), 4, b
#define DT1                              BANKMASK(PORTC), 7, a
#define DTRXP                            BANKMASK(BAUDCON1), 5, a
#define DTRXP1                           BANKMASK(BAUDCON1), 5, a
#define DTRXP2                           BANKMASK(BAUDCON2), 5, a
#define DUPLEX0                          BANKMASK(DMACON1), 2, a
#define DUPLEX1                          BANKMASK(DMACON1), 3, a
#define D_A                              BANKMASK(SSP1STAT), 5, a
#define D_A2                             BANKMASK(SSP2STAT), 5, a
#define D_MINUS                          BANKMASK(PORTC), 4, a
#define D_NOT_A2                         BANKMASK(SSP2STAT), 5, a
#define D_PLUS                           BANKMASK(PORTC), 5, a
#define D_nA2                            BANKMASK(SSP2STAT), 5, a
#define EBDIS                            BANKMASK(PR2), 7, a
#define ECCP1AS0                         BANKMASK(ECCP1AS), 4, a
#define ECCP1AS1                         BANKMASK(ECCP1AS), 5, a
#define ECCP1AS2                         BANKMASK(ECCP1AS), 6, a
#define ECCP1ASE                         BANKMASK(ECCP1AS), 7, a
#define ECCP1MD                          BANKMASK(PMDIS0), 5, b
#define ECCP1OD                          BANKMASK(ODCON1), 0, b
#define ECCP2AS0                         BANKMASK(ECCP2AS), 4, a
#define ECCP2AS1                         BANKMASK(ECCP2AS), 5, a
#define ECCP2AS2                         BANKMASK(ECCP2AS), 6, a
#define ECCP2ASE                         BANKMASK(ECCP2AS), 7, a
#define ECCP2MD                          BANKMASK(PMDIS0), 6, b
#define ECCP2OD                          BANKMASK(ODCON1), 1, b
#define ECCP3AS0                         BANKMASK(ECCP3AS), 4, b
#define ECCP3AS1                         BANKMASK(ECCP3AS), 5, b
#define ECCP3AS2                         BANKMASK(ECCP3AS), 6, b
#define ECCP3ASE                         BANKMASK(ECCP3AS), 7, b
#define ECCP3MD                          BANKMASK(PMDIS0), 7, b
#define ECCP3OD                          BANKMASK(ODCON1), 2, b
#define EDG1POL                          BANKMASK(CTMUCONL), 4, a
#define EDG1SEL0                         BANKMASK(CTMUCONL), 2, a
#define EDG1SEL1                         BANKMASK(CTMUCONL), 3, a
#define EDG1STAT                         BANKMASK(CTMUCONL), 0, a
#define EDG2POL                          BANKMASK(CTMUCONL), 7, a
#define EDG2SEL0                         BANKMASK(CTMUCONL), 5, a
#define EDG2SEL1                         BANKMASK(CTMUCONL), 6, a
#define EDG2STAT                         BANKMASK(CTMUCONL), 1, a
#define EDGEN                            BANKMASK(CTMUCONH), 3, a
#define EDGSEQEN                         BANKMASK(CTMUCONH), 2, a
#define ENDP0                            BANKMASK(USTAT), 3, a
#define ENDP1                            BANKMASK(USTAT), 4, a
#define ENDP2                            BANKMASK(USTAT), 5, a
#define ENDP3                            BANKMASK(USTAT), 6, a
#define EP0CONDIS                        BANKMASK(UEP0), 3, b
#define EP0HSHK                          BANKMASK(UEP0), 4, b
#define EP0INEN                          BANKMASK(UEP0), 1, b
#define EP0OUTEN                         BANKMASK(UEP0), 2, b
#define EP0STALL                         BANKMASK(UEP0), 0, b
#define EP1CONDIS                        BANKMASK(UEP1), 3, b
#define EP1HSHK                          BANKMASK(UEP1), 4, b
#define EP1INEN                          BANKMASK(UEP1), 1, b
#define EP1OUTEN                         BANKMASK(UEP1), 2, b
#define EP1STALL                         BANKMASK(UEP1), 0, b
#define EP2CONDIS                        BANKMASK(UEP2), 3, b
#define EP2HSHK                          BANKMASK(UEP2), 4, b
#define EP2INEN                          BANKMASK(UEP2), 1, b
#define EP2OUTEN                         BANKMASK(UEP2), 2, b
#define EP2STALL                         BANKMASK(UEP2), 0, b
#define EP3CONDIS                        BANKMASK(UEP3), 3, b
#define EP3HSHK                          BANKMASK(UEP3), 4, b
#define EP3INEN                          BANKMASK(UEP3), 1, b
#define EP3OUTEN                         BANKMASK(UEP3), 2, b
#define EP3STALL                         BANKMASK(UEP3), 0, b
#define EP4CONDIS                        BANKMASK(UEP4), 3, b
#define EP4HSHK                          BANKMASK(UEP4), 4, b
#define EP4INEN                          BANKMASK(UEP4), 1, b
#define EP4OUTEN                         BANKMASK(UEP4), 2, b
#define EP4STALL                         BANKMASK(UEP4), 0, b
#define EP5CONDIS                        BANKMASK(UEP5), 3, b
#define EP5HSHK                          BANKMASK(UEP5), 4, b
#define EP5INEN                          BANKMASK(UEP5), 1, b
#define EP5OUTEN                         BANKMASK(UEP5), 2, b
#define EP5STALL                         BANKMASK(UEP5), 0, b
#define EP6CONDIS                        BANKMASK(UEP6), 3, b
#define EP6HSHK                          BANKMASK(UEP6), 4, b
#define EP6INEN                          BANKMASK(UEP6), 1, b
#define EP6OUTEN                         BANKMASK(UEP6), 2, b
#define EP6STALL                         BANKMASK(UEP6), 0, b
#define EP7CONDIS                        BANKMASK(UEP7), 3, b
#define EP7HSHK                          BANKMASK(UEP7), 4, b
#define EP7INEN                          BANKMASK(UEP7), 1, b
#define EP7OUTEN                         BANKMASK(UEP7), 2, b
#define EP7STALL                         BANKMASK(UEP7), 0, b
#define EPCONDIS0                        BANKMASK(UEP0), 3, b
#define EPCONDIS1                        BANKMASK(UEP1), 3, b
#define EPCONDIS10                       BANKMASK(UEP10), 3, b
#define EPCONDIS11                       BANKMASK(UEP11), 3, b
#define EPCONDIS12                       BANKMASK(UEP12), 3, b
#define EPCONDIS13                       BANKMASK(UEP13), 3, b
#define EPCONDIS14                       BANKMASK(UEP14), 3, b
#define EPCONDIS15                       BANKMASK(UEP15), 3, b
#define EPCONDIS2                        BANKMASK(UEP2), 3, b
#define EPCONDIS3                        BANKMASK(UEP3), 3, b
#define EPCONDIS4                        BANKMASK(UEP4), 3, b
#define EPCONDIS5                        BANKMASK(UEP5), 3, b
#define EPCONDIS6                        BANKMASK(UEP6), 3, b
#define EPCONDIS7                        BANKMASK(UEP7), 3, b
#define EPCONDIS8                        BANKMASK(UEP8), 3, b
#define EPCONDIS9                        BANKMASK(UEP9), 3, b
#define EPHSHK0                          BANKMASK(UEP0), 4, b
#define EPHSHK1                          BANKMASK(UEP1), 4, b
#define EPHSHK10                         BANKMASK(UEP10), 4, b
#define EPHSHK11                         BANKMASK(UEP11), 4, b
#define EPHSHK12                         BANKMASK(UEP12), 4, b
#define EPHSHK13                         BANKMASK(UEP13), 4, b
#define EPHSHK14                         BANKMASK(UEP14), 4, b
#define EPHSHK15                         BANKMASK(UEP15), 4, b
#define EPHSHK2                          BANKMASK(UEP2), 4, b
#define EPHSHK3                          BANKMASK(UEP3), 4, b
#define EPHSHK4                          BANKMASK(UEP4), 4, b
#define EPHSHK5                          BANKMASK(UEP5), 4, b
#define EPHSHK6                          BANKMASK(UEP6), 4, b
#define EPHSHK7                          BANKMASK(UEP7), 4, b
#define EPHSHK8                          BANKMASK(UEP8), 4, b
#define EPHSHK9                          BANKMASK(UEP9), 4, b
#define EPINEN0                          BANKMASK(UEP0), 1, b
#define EPINEN1                          BANKMASK(UEP1), 1, b
#define EPINEN10                         BANKMASK(UEP10), 1, b
#define EPINEN11                         BANKMASK(UEP11), 1, b
#define EPINEN12                         BANKMASK(UEP12), 1, b
#define EPINEN13                         BANKMASK(UEP13), 1, b
#define EPINEN14                         BANKMASK(UEP14), 1, b
#define EPINEN15                         BANKMASK(UEP15), 1, b
#define EPINEN2                          BANKMASK(UEP2), 1, b
#define EPINEN3                          BANKMASK(UEP3), 1, b
#define EPINEN4                          BANKMASK(UEP4), 1, b
#define EPINEN5                          BANKMASK(UEP5), 1, b
#define EPINEN6                          BANKMASK(UEP6), 1, b
#define EPINEN7                          BANKMASK(UEP7), 1, b
#define EPINEN8                          BANKMASK(UEP8), 1, b
#define EPINEN9                          BANKMASK(UEP9), 1, b
#define EPOUTEN0                         BANKMASK(UEP0), 2, b
#define EPOUTEN1                         BANKMASK(UEP1), 2, b
#define EPOUTEN10                        BANKMASK(UEP10), 2, b
#define EPOUTEN11                        BANKMASK(UEP11), 2, b
#define EPOUTEN12                        BANKMASK(UEP12), 2, b
#define EPOUTEN13                        BANKMASK(UEP13), 2, b
#define EPOUTEN14                        BANKMASK(UEP14), 2, b
#define EPOUTEN15                        BANKMASK(UEP15), 2, b
#define EPOUTEN2                         BANKMASK(UEP2), 2, b
#define EPOUTEN3                         BANKMASK(UEP3), 2, b
#define EPOUTEN4                         BANKMASK(UEP4), 2, b
#define EPOUTEN5                         BANKMASK(UEP5), 2, b
#define EPOUTEN6                         BANKMASK(UEP6), 2, b
#define EPOUTEN7                         BANKMASK(UEP7), 2, b
#define EPOUTEN8                         BANKMASK(UEP8), 2, b
#define EPOUTEN9                         BANKMASK(UEP9), 2, b
#define EPSTALL0                         BANKMASK(UEP0), 0, b
#define EPSTALL1                         BANKMASK(UEP1), 0, b
#define EPSTALL10                        BANKMASK(UEP10), 0, b
#define EPSTALL11                        BANKMASK(UEP11), 0, b
#define EPSTALL12                        BANKMASK(UEP12), 0, b
#define EPSTALL13                        BANKMASK(UEP13), 0, b
#define EPSTALL14                        BANKMASK(UEP14), 0, b
#define EPSTALL15                        BANKMASK(UEP15), 0, b
#define EPSTALL2                         BANKMASK(UEP2), 0, b
#define EPSTALL3                         BANKMASK(UEP3), 0, b
#define EPSTALL4                         BANKMASK(UEP4), 0, b
#define EPSTALL5                         BANKMASK(UEP5), 0, b
#define EPSTALL6                         BANKMASK(UEP6), 0, b
#define EPSTALL7                         BANKMASK(UEP7), 0, b
#define EPSTALL8                         BANKMASK(UEP8), 0, b
#define EPSTALL9                         BANKMASK(UEP9), 0, b
#define EVPOL01                          BANKMASK(CM1CON), 3, a
#define EVPOL02                          BANKMASK(CM2CON), 3, a
#define EVPOL03                          BANKMASK(CM3CON), 3, b
#define EVPOL05                          BANKMASK(IPR5), 3, a
#define EVPOL11                          BANKMASK(CM1CON), 4, a
#define EVPOL12                          BANKMASK(CM2CON), 4, a
#define EVPOL13                          BANKMASK(CM3CON), 4, b
#define EVPOL15                          BANKMASK(IPR5), 4, a
#define FERR1                            BANKMASK(RCSTA1), 2, a
#define FERR2                            BANKMASK(RCSTA2), 2, a
#define FLTS                             BANKMASK(OSCCON), 2, a
#define FREE                             BANKMASK(EECON1), 4, a
#define FRM0                             BANKMASK(UFRML), 0, a
#define FRM1                             BANKMASK(UFRML), 1, a
#define FRM10                            BANKMASK(UFRMH), 2, a
#define FRM2                             BANKMASK(UFRML), 2, a
#define FRM3                             BANKMASK(UFRML), 3, a
#define FRM4                             BANKMASK(UFRML), 4, a
#define FRM5                             BANKMASK(UFRML), 5, a
#define FRM6                             BANKMASK(UFRML), 6, a
#define FRM7                             BANKMASK(UFRML), 7, a
#define FRM8                             BANKMASK(UFRMH), 0, a
#define FRM9                             BANKMASK(UFRMH), 1, a
#define FSEN                             BANKMASK(UCFG), 2, b
#define GCEN1                            BANKMASK(SSP1CON2), 7, a
#define GCEN2                            BANKMASK(SSP2CON2), 7, a
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define GO                               BANKMASK(ADCON0), 1, a
#define GODONE                           BANKMASK(ADCON0), 1, a
#define GO_DONE                          BANKMASK(ADCON0), 1, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 1, a
#define GO_nDONE                         BANKMASK(ADCON0), 1, a
#define HALFSEC                          BANKMASK(RTCCFG), 3, b
#define HLVDEN                           BANKMASK(HLVDCON), 4, a
#define HLVDIE                           BANKMASK(PIE2), 2, a
#define HLVDIF                           BANKMASK(PIR2), 2, a
#define HLVDIN                           BANKMASK(PORTA), 5, a
#define HLVDIP                           BANKMASK(IPR2), 2, a
#define HLVDL0                           BANKMASK(HLVDCON), 0, a
#define HLVDL1                           BANKMASK(HLVDCON), 1, a
#define HLVDL2                           BANKMASK(HLVDCON), 2, a
#define HLVDL3                           BANKMASK(HLVDCON), 3, a
#define I2C_DAT                          BANKMASK(SSP1STAT), 5, a
#define I2C_DAT2                         BANKMASK(SSP2STAT), 5, a
#define I2C_READ                         BANKMASK(SSP1STAT), 2, a
#define I2C_READ2                        BANKMASK(SSP2STAT), 2, a
#define I2C_START                        BANKMASK(SSP1STAT), 3, a
#define I2C_START2                       BANKMASK(SSP2STAT), 3, a
#define I2C_STOP                         BANKMASK(SSP1STAT), 4, a
#define I2C_STOP2                        BANKMASK(SSP2STAT), 4, a
#define IB0F                             BANKMASK(PMSTATH), 0, b
#define IB1F                             BANKMASK(PMSTATH), 1, b
#define IB2F                             BANKMASK(PMSTATH), 2, b
#define IB3F                             BANKMASK(PMSTATH), 3, b
#define IBF                              BANKMASK(PMSTATH), 7, b
#define IBOV                             BANKMASK(PMSTATH), 6, b
#define IDISSEN                          BANKMASK(CTMUCONH), 1, a
#define IDLEIE                           BANKMASK(UIE), 4, b
#define IDLEIF                           BANKMASK(UIR), 4, a
#define IDLEN                            BANKMASK(OSCCON), 7, a
#define INCM0                            BANKMASK(PMMODEH), 3, b
#define INCM1                            BANKMASK(PMMODEH), 4, b
#define INT0                             BANKMASK(PORTB), 0, a
#define INT0E                            BANKMASK(INTCON), 4, a
#define INT0F                            BANKMASK(INTCON), 1, a
#define INT0IE                           BANKMASK(INTCON), 4, a
#define INT0IF                           BANKMASK(INTCON), 1, a
#define INT1E                            BANKMASK(INTCON3), 3, a
#define INT1F                            BANKMASK(INTCON3), 0, a
#define INT1IE                           BANKMASK(INTCON3), 3, a
#define INT1IF                           BANKMASK(INTCON3), 0, a
#define INT1IP                           BANKMASK(INTCON3), 6, a
#define INT1P                            BANKMASK(INTCON3), 6, a
#define INT2E                            BANKMASK(INTCON3), 4, a
#define INT2F                            BANKMASK(INTCON3), 1, a
#define INT2IE                           BANKMASK(INTCON3), 4, a
#define INT2IF                           BANKMASK(INTCON3), 1, a
#define INT2IP                           BANKMASK(INTCON3), 7, a
#define INT2P                            BANKMASK(INTCON3), 7, a
#define INT3E                            BANKMASK(INTCON3), 5, a
#define INT3F                            BANKMASK(INTCON3), 2, a
#define INT3IE                           BANKMASK(INTCON3), 5, a
#define INT3IF                           BANKMASK(INTCON3), 2, a
#define INT3IP                           BANKMASK(INTCON2), 1, a
#define INT3P                            BANKMASK(INTCON2), 1, a
#define INTEDG0                          BANKMASK(INTCON2), 6, a
#define INTEDG1                          BANKMASK(INTCON2), 5, a
#define INTEDG2                          BANKMASK(INTCON2), 4, a
#define INTEDG3                          BANKMASK(INTCON2), 3, a
#define INTLVL0                          BANKMASK(DMACON2), 0, a
#define INTLVL1                          BANKMASK(DMACON2), 1, a
#define INTLVL2                          BANKMASK(DMACON2), 2, a
#define INTLVL3                          BANKMASK(DMACON2), 3, a
#define INTSRC                           BANKMASK(OSCTUNE), 7, a
#define IOLOCK                           BANKMASK(PPSCON), 0, b
#define IPEN                             BANKMASK(RCON), 7, a
#define IRCF0                            BANKMASK(OSCCON), 4, a
#define IRCF1                            BANKMASK(OSCCON), 5, a
#define IRCF2                            BANKMASK(OSCCON), 6, a
#define IRNG0                            BANKMASK(CTMUICON), 0, a
#define IRNG1                            BANKMASK(CTMUICON), 1, a
#define IRQM0                            BANKMASK(PMMODEH), 5, b
#define IRQM1                            BANKMASK(PMMODEH), 6, b
#define IRVST                            BANKMASK(HLVDCON), 5, a
#define ITRIM0                           BANKMASK(CTMUICON), 2, a
#define ITRIM1                           BANKMASK(CTMUICON), 3, a
#define ITRIM2                           BANKMASK(CTMUICON), 4, a
#define ITRIM3                           BANKMASK(CTMUICON), 5, a
#define ITRIM4                           BANKMASK(CTMUICON), 6, a
#define ITRIM5                           BANKMASK(CTMUICON), 7, a
#define KBI0                             BANKMASK(PORTB), 4, a
#define KBI1                             BANKMASK(PORTB), 5, a
#define KBI2                             BANKMASK(PORTB), 6, a
#define KBI3                             BANKMASK(PORTB), 7, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LA7                              BANKMASK(LATA), 7, a
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LATD0                            BANKMASK(LATD), 0, a
