GopalSaraf/Practicals/PSDL/include/proc/pic18lf46j53.inc
#define LATD1                            BANKMASK(LATD), 1, a
#define LATD2                            BANKMASK(LATD), 2, a
#define LATD3                            BANKMASK(LATD), 3, a
#define LATD4                            BANKMASK(LATD), 4, a
#define LATD5                            BANKMASK(LATD), 5, a
#define LATD6                            BANKMASK(LATD), 6, a
#define LATD7                            BANKMASK(LATD), 7, a
#define LATE0                            BANKMASK(LATE), 0, a
#define LATE1                            BANKMASK(LATE), 1, a
#define LATE2                            BANKMASK(LATE), 2, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LD0                              BANKMASK(LATD), 0, a
#define LD1                              BANKMASK(LATD), 1, a
#define LD2                              BANKMASK(LATD), 2, a
#define LD3                              BANKMASK(LATD), 3, a
#define LD4                              BANKMASK(LATD), 4, a
#define LD5                              BANKMASK(LATD), 5, a
#define LD6                              BANKMASK(LATD), 6, a
#define LD7                              BANKMASK(LATD), 7, a
#define LE0                              BANKMASK(LATE), 0, a
#define LE1                              BANKMASK(LATE), 1, a
#define LE2                              BANKMASK(LATE), 2, a
#define LVDIE                            BANKMASK(PIE2), 2, a
#define LVDIF                            BANKMASK(PIR2), 2, a
#define LVDIN                            BANKMASK(PORTA), 5, a
#define LVDIP                            BANKMASK(IPR2), 2, a
#define LVDSTAT                          BANKMASK(WDTCON), 6, a
#define MODE0                            BANKMASK(PMMODEH), 0, b
#define MODE1                            BANKMASK(PMMODEH), 1, b
#define MODE16                           BANKMASK(PMMODEH), 2, b
#define MSK01                            BANKMASK(SSP1ADD), 0, a
#define MSK02                            BANKMASK(SSP2ADD), 0, a
#define MSK11                            BANKMASK(SSP1ADD), 1, a
#define MSK12                            BANKMASK(SSP2ADD), 1, a
#define MSK21                            BANKMASK(SSP1ADD), 2, a
#define MSK22                            BANKMASK(SSP2ADD), 2, a
#define MSK31                            BANKMASK(SSP1ADD), 3, a
#define MSK32                            BANKMASK(SSP2ADD), 3, a
#define MSK41                            BANKMASK(SSP1ADD), 4, a
#define MSK42                            BANKMASK(SSP2ADD), 4, a
#define MSK51                            BANKMASK(SSP1ADD), 5, a
#define MSK52                            BANKMASK(SSP2ADD), 5, a
#define MSK61                            BANKMASK(SSP1ADD), 6, a
#define MSK62                            BANKMASK(SSP2ADD), 6, a
#define MSK71                            BANKMASK(SSP1ADD), 7, a
#define MSK72                            BANKMASK(SSP2ADD), 7, a
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOT_A                            BANKMASK(SSP1STAT), 5, a
#define NOT_A2                           BANKMASK(SSP2STAT), 5, a
#define NOT_ADDRESS                      BANKMASK(SSP1STAT), 5, a
#define NOT_ADDRESS2                     BANKMASK(SSP2STAT), 5, a
#define NOT_BOR                          BANKMASK(RCON), 0, a
#define NOT_CM                           BANKMASK(RCON), 5, a
#define NOT_DONE                         BANKMASK(ADCON0), 1, a
#define NOT_PD                           BANKMASK(RCON), 2, a
#define NOT_POR                          BANKMASK(RCON), 1, a
#define NOT_RBPU                         BANKMASK(INTCON2), 7, a
#define NOT_RC8                          BANKMASK(RCSTA1), 6, a
#define NOT_RI                           BANKMASK(RCON), 4, a
#define NOT_SS1                          BANKMASK(PORTA), 5, a
#define NOT_T1DONE                       BANKMASK(T1GCON), 3, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3DONE                       BANKMASK(T3GCON), 3, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_T5DONE                       BANKMASK(T5GCON), 3, b
#define NOT_T5SYNC                       BANKMASK(T5CON), 2, b
#define NOT_TO                           BANKMASK(RCON), 3, a
#define NOT_TX8                          BANKMASK(TXSTA1), 6, a
#define NOT_UOE                          BANKMASK(PORTC), 1, a
#define NOT_W                            BANKMASK(SSP1STAT), 2, a
#define NOT_W2                           BANKMASK(SSP2STAT), 2, a
#define NOT_WRITE                        BANKMASK(SSP1STAT), 2, a
#define NOT_WRITE2                       BANKMASK(SSP2STAT), 2, a
#define OB0E                             BANKMASK(PMSTATL), 0, b
#define OB1E                             BANKMASK(PMSTATL), 1, b
#define OB2E                             BANKMASK(PMSTATL), 2, b
#define OB3E                             BANKMASK(PMSTATL), 3, b
#define OBE                              BANKMASK(PMSTATL), 7, b
#define OBUF                             BANKMASK(PMSTATL), 6, b
#define OERR1                            BANKMASK(RCSTA1), 1, a
#define OERR2                            BANKMASK(RCSTA2), 1, a
#define OSC1                             BANKMASK(PORTA), 7, a
#define OSC2                             BANKMASK(PORTA), 6, a
#define OSCFIE                           BANKMASK(PIE2), 7, a
#define OSCFIF                           BANKMASK(PIR2), 7, a
#define OSCFIP                           BANKMASK(IPR2), 7, a
#define OSTS                             BANKMASK(OSCCON), 3, a
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define P1DC0                            BANKMASK(ECCP1DEL), 0, a
#define P1DC1                            BANKMASK(ECCP1DEL), 1, a
#define P1DC2                            BANKMASK(ECCP1DEL), 2, a
#define P1DC3                            BANKMASK(ECCP1DEL), 3, a
#define P1DC4                            BANKMASK(ECCP1DEL), 4, a
#define P1DC5                            BANKMASK(ECCP1DEL), 5, a
#define P1DC6                            BANKMASK(ECCP1DEL), 6, a
#define P1M0                             BANKMASK(CCP1CON), 6, a
#define P1M1                             BANKMASK(CCP1CON), 7, a
#define P1RSEN                           BANKMASK(ECCP1DEL), 7, a
#define P2                               BANKMASK(SSP2STAT), 4, a
#define P2DC02                           BANKMASK(PSTR2CON), 0, a
#define P2DC0CON                         BANKMASK(PSTR2CON), 0, a
#define P2DC12                           BANKMASK(PSTR2CON), 1, a
#define P2DC1CON                         BANKMASK(PSTR2CON), 1, a
#define P2DC22                           BANKMASK(PSTR2CON), 2, a
#define P2DC2CON                         BANKMASK(PSTR2CON), 2, a
#define P2DC32                           BANKMASK(PSTR2CON), 3, a
#define P2DC3CON                         BANKMASK(PSTR2CON), 3, a
#define P2DC42                           BANKMASK(PSTR2CON), 4, a
#define P2DC4CON                         BANKMASK(PSTR2CON), 4, a
#define P2DC52                           BANKMASK(PSTR2CON), 5, a
#define P2DC5CON                         BANKMASK(PSTR2CON), 5, a
#define P2DC62                           BANKMASK(PSTR2CON), 6, a
#define P2DC6CON                         BANKMASK(PSTR2CON), 6, a
#define P2M0                             BANKMASK(CCP2CON), 6, a
#define P2M1                             BANKMASK(CCP2CON), 7, a
#define P2RSEN                           BANKMASK(ECCP2DEL), 7, a
#define P3DC0                            BANKMASK(ECCP3DEL), 0, b
#define P3DC1                            BANKMASK(ECCP3DEL), 1, b
#define P3DC2                            BANKMASK(ECCP3DEL), 2, b
#define P3DC3                            BANKMASK(ECCP3DEL), 3, b
#define P3DC4                            BANKMASK(ECCP3DEL), 4, b
#define P3DC5                            BANKMASK(ECCP3DEL), 5, b
#define P3DC6                            BANKMASK(ECCP3DEL), 6, b
#define P3M0                             BANKMASK(CCP3CON), 6, b
#define P3M1                             BANKMASK(CCP3CON), 7, b
#define P3RSEN                           BANKMASK(ECCP3DEL), 7, b
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2                              BANKMASK(PORTC), 1, a
#define PB2                              BANKMASK(PORTE), 2, a
#define PC2                              BANKMASK(PORTE), 1, a
#define PCFG0                            BANKMASK(ANCON0), 0, b
#define PCFG1                            BANKMASK(ANCON0), 1, b
#define PCFG10                           BANKMASK(ANCON1), 2, b
#define PCFG11                           BANKMASK(ANCON1), 3, b
#define PCFG12                           BANKMASK(ANCON1), 4, b
#define PCFG15                           BANKMASK(ANCON1), 7, b
#define PCFG2                            BANKMASK(ANCON0), 2, b
#define PCFG3                            BANKMASK(ANCON0), 3, b
#define PCFG4                            BANKMASK(ANCON0), 4, b
#define PCFG5                            BANKMASK(ANCON0), 5, b
#define PCFG6                            BANKMASK(ANCON0), 6, b
#define PCFG7                            BANKMASK(ANCON0), 7, b
#define PCFG8                            BANKMASK(ANCON1), 0, b
#define PCFG9                            BANKMASK(ANCON1), 1, b
#define PD                               BANKMASK(RCON), 2, a
#define PD2                              BANKMASK(PORTE), 0, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PEN1                             BANKMASK(SSP1CON2), 2, a
#define PEN2                             BANKMASK(SSP2CON2), 2, a
#define PGC                              BANKMASK(PORTB), 6, a
#define PGD                              BANKMASK(PORTB), 7, a
#define PIDEE                            BANKMASK(UEIE), 0, b
#define PIDEF                            BANKMASK(UEIR), 0, a
#define PKTDIS                           BANKMASK(UCON), 4, a
#define PLLEN                            BANKMASK(OSCTUNE), 6, a
#define PMA0                             BANKMASK(PORTB), 5, a
#define PMA1                             BANKMASK(PORTB), 4, a
#define PMA2                             BANKMASK(PORTB), 3, a
#define PMA3                             BANKMASK(PORTB), 2, a
#define PMA4                             BANKMASK(PORTC), 7, a
#define PMA5                             BANKMASK(PORTC), 6, a
#define PMA6                             BANKMASK(PORTA), 0, a
#define PMA7                             BANKMASK(PORTA), 1, a
#define PMBE                             BANKMASK(PORTB), 1, a
#define PMCS                             BANKMASK(PORTE), 2, a
#define PMD0                             BANKMASK(PORTD), 0, a
#define PMD1                             BANKMASK(PORTD), 1, a
#define PMD2                             BANKMASK(PORTD), 2, a
#define PMD3                             BANKMASK(PORTD), 3, a
#define PMD4                             BANKMASK(PORTD), 4, a
#define PMD5                             BANKMASK(PORTD), 5, a
#define PMD6                             BANKMASK(PORTD), 6, a
#define PMD7                             BANKMASK(PORTD), 7, a
#define PMDADC                           BANKMASK(PMDIS0), 0, b
#define PMDCCP10                         BANKMASK(PMDIS3), 7, b
#define PMDCCP4                          BANKMASK(PMDIS3), 1, b
#define PMDCCP5                          BANKMASK(PMDIS3), 2, b
#define PMDCCP6                          BANKMASK(PMDIS3), 3, b
#define PMDCCP7                          BANKMASK(PMDIS3), 4, b
#define PMDCCP8                          BANKMASK(PMDIS3), 5, b
#define PMDCCP9                          BANKMASK(PMDIS3), 6, b
#define PMDCMP1                          BANKMASK(PMDIS2), 0, b
#define PMDCMP2                          BANKMASK(PMDIS2), 1, b
#define PMDCMP3                          BANKMASK(PMDIS2), 2, b
#define PMDCTMU                          BANKMASK(PMDIS1), 6, b
#define PMDECCP1                         BANKMASK(PMDIS0), 5, b
#define PMDECCP2                         BANKMASK(PMDIS0), 6, b
#define PMDECCP3                         BANKMASK(PMDIS0), 7, b
#define PMDMSSP1                         BANKMASK(PMDIS0), 1, b
#define PMDMSSP2                         BANKMASK(PMDIS0), 2, b
#define PMDPSP                           BANKMASK(PMDIS1), 7, b
#define PMDRTCC                          BANKMASK(PMDIS1), 5, b
#define PMDTMR1                          BANKMASK(PMDIS1), 1, b
#define PMDTMR2                          BANKMASK(PMDIS1), 2, b
#define PMDTMR3                          BANKMASK(PMDIS1), 3, b
#define PMDTMR4                          BANKMASK(PMDIS1), 4, b
#define PMDTMR5                          BANKMASK(PMDIS2), 3, b
#define PMDTMR6                          BANKMASK(PMDIS2), 4, b
#define PMDTMR8                          BANKMASK(PMDIS2), 6, b
#define PMDUART1                         BANKMASK(PMDIS0), 3, b
#define PMDUART2                         BANKMASK(PMDIS0), 4, b
#define PMPBE                            BANKMASK(PORTB), 1, a
#define PMPCS                            BANKMASK(PORTE), 2, a
#define PMPEN                            BANKMASK(PMCONH), 7, b
#define PMPIE                            BANKMASK(PIE1), 7, a
#define PMPIF                            BANKMASK(PIR1), 7, a
#define PMPIP                            BANKMASK(IPR1), 7, a
#define PMPRD                            BANKMASK(PORTE), 0, a
#define PMPTTL                           BANKMASK(PADCFG1), 0, b
#define PMPWR                            BANKMASK(PORTE), 1, a
#define PMRD                             BANKMASK(PORTE), 0, a
#define PMWR                             BANKMASK(PORTE), 1, a
#define POR                              BANKMASK(RCON), 1, a
#define PPB0                             BANKMASK(UCFG), 0, b
#define PPB1                             BANKMASK(UCFG), 1, b
#define PPBI                             BANKMASK(USTAT), 1, a
#define PPBRST                           BANKMASK(UCON), 6, a
#define PRISD                            BANKMASK(OSCCON2), 2, a
#define PSA                              BANKMASK(T0CON), 3, a
#define PSIDL                            BANKMASK(PMCONH), 5, b
#define PSPIE                            BANKMASK(PIE1), 7, a
#define PSPIF                            BANKMASK(PIR1), 7, a
#define PSPIP                            BANKMASK(IPR1), 7, a
#define PSPMD                            BANKMASK(PMDIS1), 7, b
#define PSS1AC0                          BANKMASK(ECCP1AS), 2, a
#define PSS1AC1                          BANKMASK(ECCP1AS), 3, a
#define PSS1BD0                          BANKMASK(ECCP1AS), 0, a
#define PSS1BD1                          BANKMASK(ECCP1AS), 1, a
#define PSS2AC0                          BANKMASK(ECCP2AS), 2, a
#define PSS2AC1                          BANKMASK(ECCP2AS), 3, a
#define PSS2BD0                          BANKMASK(ECCP2AS), 0, a
#define PSS2BD1                          BANKMASK(ECCP2AS), 1, a
#define PSS3AC0                          BANKMASK(ECCP3AS), 2, b
#define PSS3AC1                          BANKMASK(ECCP3AS), 3, b
#define PSS3BD0                          BANKMASK(ECCP3AS), 0, b
#define PSS3BD1                          BANKMASK(ECCP3AS), 1, b
#define PTBEEN                           BANKMASK(PMCONH), 2, b
#define PTEN0                            BANKMASK(PMEL), 0, b
#define PTEN1                            BANKMASK(PMEL), 1, b
#define PTEN10                           BANKMASK(PMEH), 2, b
#define PTEN11                           BANKMASK(PMEH), 3, b
#define PTEN12                           BANKMASK(PMEH), 4, b
#define PTEN13                           BANKMASK(PMEH), 5, b
#define PTEN14                           BANKMASK(PMEH), 6, b
#define PTEN15                           BANKMASK(PMEH), 7, b
#define PTEN2                            BANKMASK(PMEL), 2, b
#define PTEN3                            BANKMASK(PMEL), 3, b
#define PTEN4                            BANKMASK(PMEL), 4, b
#define PTEN5                            BANKMASK(PMEL), 5, b
#define PTEN6                            BANKMASK(PMEL), 6, b
#define PTEN7                            BANKMASK(PMEL), 7, b
#define PTEN8                            BANKMASK(PMEH), 0, b
#define PTEN9                            BANKMASK(PMEH), 1, b
#define PTRDEN                           BANKMASK(PMCONH), 0, b
#define PTWREN                           BANKMASK(PMCONH), 1, b
#define RA0                              BANKMASK(PORTA), 0, a
#define RA1                              BANKMASK(PORTA), 1, a
#define RA2                              BANKMASK(PORTA), 2, a
#define RA3                              BANKMASK(PORTA), 3, a
#define RA5                              BANKMASK(PORTA), 5, a
#define RA6                              BANKMASK(PORTA), 6, a
#define RA7                              BANKMASK(PORTA), 7, a
#define RB0                              BANKMASK(PORTB), 0, a
#define RB1                              BANKMASK(PORTB), 1, a
#define RB2                              BANKMASK(PORTB), 2, a
#define RB3                              BANKMASK(PORTB), 3, a
#define RB4                              BANKMASK(PORTB), 4, a
#define RB5                              BANKMASK(PORTB), 5, a
#define RB6                              BANKMASK(PORTB), 6, a
#define RB7                              BANKMASK(PORTB), 7, a
#define RBIE                             BANKMASK(INTCON), 3, a
#define RBIF                             BANKMASK(INTCON), 0, a
#define RBIP                             BANKMASK(INTCON2), 0, a
#define RBPU                             BANKMASK(INTCON2), 7, a
#define RC0                              BANKMASK(PORTC), 0, a
#define RC1                              BANKMASK(PORTC), 1, a
#define RC1IE                            BANKMASK(PIE1), 5, a
#define RC1IF                            BANKMASK(PIR1), 5, a
#define RC1IP                            BANKMASK(IPR1), 5, a
#define RC2                              BANKMASK(PORTC), 2, a
#define RC2IE                            BANKMASK(PIE3), 5, a
#define RC2IF                            BANKMASK(PIR3), 5, a
#define RC2IP                            BANKMASK(IPR3), 5, a
#define RC4                              BANKMASK(PORTC), 4, a
#define RC5                              BANKMASK(PORTC), 5, a
#define RC6                              BANKMASK(PORTC), 6, a
#define RC7                              BANKMASK(PORTC), 7, a
#define RC8_9                            BANKMASK(RCSTA1), 6, a
#define RC8_92                           BANKMASK(RCSTA2), 6, a
#define RC9                              BANKMASK(RCSTA1), 6, a
#define RC92                             BANKMASK(RCSTA2), 6, a
#define RCD8                             BANKMASK(RCSTA1), 0, a
#define RCD82                            BANKMASK(RCSTA2), 0, a
#define RCEN1                            BANKMASK(SSP1CON2), 3, a
#define RCEN2                            BANKMASK(SSP2CON2), 3, a
#define RCIDL1                           BANKMASK(BAUDCON1), 6, a
#define RCIDL2                           BANKMASK(BAUDCON2), 6, a
#define RCIE                             BANKMASK(PIE1), 5, a
#define RCIF                             BANKMASK(PIR1), 5, a
#define RCIP                             BANKMASK(IPR1), 5, a
#define RCMT                             BANKMASK(BAUDCON1), 6, a
#define RCMT1                            BANKMASK(BAUDCON1), 6, a
#define RCMT2                            BANKMASK(BAUDCON2), 6, a
#define RCV                              BANKMASK(PORTA), 5, a
#define RD0                              BANKMASK(PORTD), 0, a
#define RD1                              BANKMASK(PORTD), 1, a
#define RD163                            BANKMASK(T3CON), 7, a
#define RD165                            BANKMASK(T5CON), 1, b
#define RD2                              BANKMASK(PORTD), 2, a
#define RD3                              BANKMASK(PORTD), 3, a
#define RD4                              BANKMASK(PORTD), 4, a
#define RD5                              BANKMASK(PORTD), 5, a
#define RD6                              BANKMASK(PORTD), 6, a
#define RD7                              BANKMASK(PORTD), 7, a
#define RDE                              BANKMASK(PORTE), 0, a
#define RDPU                             BANKMASK(TRISE), 7, a
#define RDSP                             BANKMASK(PMCONL), 0, b
#define RE0                              BANKMASK(PORTE), 0, a
#define RE1                              BANKMASK(PORTE), 1, a
#define RE2                              BANKMASK(PORTE), 2, a
#define READ_WRITE                       BANKMASK(SSP1STAT), 2, a
#define READ_WRITE2                      BANKMASK(SSP2STAT), 2, a
#define REFO                             BANKMASK(PORTB), 2, a
#define REGSLP                           BANKMASK(WDTCON), 7, a
#define RELEASE                          BANKMASK(DSCONL), 0, b
#define REPU                             BANKMASK(TRISE), 6, a
#define RESUME                           BANKMASK(UCON), 2, a
#define RI                               BANKMASK(RCON), 4, a
#define RJPU                             BANKMASK(PORTA), 7, a
#define RODIV0                           BANKMASK(REFOCON), 0, b
#define RODIV1                           BANKMASK(REFOCON), 1, b
#define RODIV2                           BANKMASK(REFOCON), 2, b
#define RODIV3                           BANKMASK(REFOCON), 3, b
#define ROON                             BANKMASK(REFOCON), 7, b
#define ROSEL                            BANKMASK(REFOCON), 4, b
#define ROSSLP                           BANKMASK(REFOCON), 5, b
#define RP0                              BANKMASK(PORTA), 0, a
#define RP1                              BANKMASK(PORTA), 1, a
#define RP10                             BANKMASK(PORTB), 7, a
#define RP11                             BANKMASK(PORTC), 0, a
#define RP12                             BANKMASK(PORTC), 1, a
#define RP13                             BANKMASK(PORTC), 2, a
#define RP17                             BANKMASK(PORTC), 6, a
#define RP18                             BANKMASK(PORTC), 7, a
#define RP19                             BANKMASK(PORTD), 2, a
#define RP2                              BANKMASK(PORTA), 5, a
#define RP20                             BANKMASK(PORTD), 3, a
#define RP21                             BANKMASK(PORTD), 4, a
#define RP22                             BANKMASK(PORTD), 5, a
#define RP23                             BANKMASK(PORTD), 6, a
#define RP24                             BANKMASK(PORTD), 7, a
#define RP3                              BANKMASK(PORTB), 0, a
#define RP4                              BANKMASK(PORTB), 1, a
#define RP5                              BANKMASK(PORTB), 2, a
#define RP6                              BANKMASK(PORTB), 3, a
#define RP7                              BANKMASK(PORTB), 4, a
#define RP8                              BANKMASK(PORTB), 5, a
#define RP9                              BANKMASK(PORTB), 6, a
#define RSEN1                            BANKMASK(SSP1CON2), 1, a
#define RSEN2                            BANKMASK(SSP2CON2), 1, a
#define RTCC                             BANKMASK(PORTB), 1, a
#define RTCCIE                           BANKMASK(PIE3), 0, a
